In [1]:
# TODO: creati un decorator de tva care sa returneze pretul cu TVA al produsului pentru cele 2 functii de mai jos!

# def get_phone_price(price):
#     print(f"Price of phone is: {price}")
#     return price

# def get_laptop_price(price):
#     print(f"Price of laptop is: {price}")
#     return price

In [5]:
def decorator_tva(original_func):
    def wrapper(price):
        price_including_tva = price * 1.19
        print (f'Price of product including TVA: {price_including_tva}')
        return price_including_tva
    return wrapper

In [6]:
@decorator_tva
def get_phone_price(price):
    print(f"Price of phone is: {price}")
    return price

In [7]:
@decorator_tva
def get_laptop_price(price):
    print(f"Price of laptop is: {price}")
    return price

In [8]:
get_phone_price(100)

Price of product including TVA: 119.0

119.0

In [10]:
get_laptop_price(2000)

Price of product including TVA: 2380.0

2380.0

In [11]:
import sqlite3

In [12]:
conn = sqlite3.connect("test.db")

In [13]:
cur = conn.cursor()

In [14]:
cur.executescript("""
CREATE TABLE Students (
id INTEGER PRIMARY KEY AUTOINCREMENT,    
name TEXT NOT NULL,
email TEXT NOT NULL,
age INTEGER NOT NULL CHECK (age > 0),
class_id INTEGER NOT NULL,
FOREIGN KEY(class_id) REFERENCES Classes(id)
);


CREATE TABLE Grades (
id INTEGER PRIMARY KEY AUTOINCREMENT,    
topic TEXT NOT NULL,
grade REAL NOT NULL CHECK (grade BETWEEN 0.0 AND 10.0),
student_id INTEGER NOT NULL,
FOREIGN KEY(student_id) REFERENCES Students(id)
);
""")

In [15]:
cur.execute("SELECT * FROM Students;")

In [16]:
cur.fetchall()

[]

In [17]:
cur.execute("INSERT INTO Students (name, email, age) VALUES ('Avram Bogdan', 'avram.bogdan@myschool.com', 18);")
cur.execute("INSERT INTO Students (name, email, age) VALUES ('Constantinescu Diana', 'constantinescu.diana@myschool.com', 19);")

In [18]:
cur.execute("SELECT * FROM Students;")
cur.fetchall()

[(1, 'Avram Bogdan', 'avram.bogdan@myschool.com', 18),
 (2, 'Constantinescu Diana', 'constantinescu.diana@myschool.com', 19)]

In [19]:
conn.commit()

In [20]:
cur.execute("INSERT INTO Students (name, email, age) VALUES ('Ene Flavia', 'ene.flavia@myschool.com', 20);")

In [21]:
cur.execute("SELECT * FROM Students WHERE id=1;")
cur.fetchall()

[(1, 'Avram Bogdan', 'avram.bogdan@myschool.com', 18)]

In [22]:
grades_values = [
    ("Informatica", 8, 1),
    ("Informatica", 10, 1),
    ("Matematica", 9, 1),
    ("Limba Romana", 10, 2),
    ("Chimie", 9, 2),
    ("Engleza", 10, 3),
    ("Engleza", 6, 1),
    ("Informatica", 6, 3),
    ("Informatica", 10, 2)
       
]

sql_query = "INSERT INTO Grades (topic, grade, student_id) VALUES (?, ?, ?)"
cur.executemany(sql_query, grades_values)

In [23]:
cur.execute("SELECT * FROM Grades;")

In [24]:
cur.fetchall()

[(1, 'Informatica', 8.0, 1),
 (2, 'Informatica', 10.0, 1),
 (3, 'Matematica', 9.0, 1),
 (4, 'Limba Romana', 10.0, 2),
 (5, 'Chimie', 9.0, 2),
 (6, 'Engleza', 10.0, 3),
 (7, 'Engleza', 6.0, 1),
 (8, 'Informatica', 6.0, 3),
 (9, 'Informatica', 10.0, 2)]

In [25]:
cur.execute("INSERT INTO Students (name, email, age) VALUES ('Gheorghe Hagiu', 'ene.flavia@myschool.com', -1);")

IntegrityError: CHECK constraint failed: age > 0

In [28]:
conn.commit()

In [31]:
# Vrem sa returnam din baza de date toate notele studentei Ene Flavia

cur.execute("SELECT * FROM Grades g JOIN Students s ON g.student_id=s.id WHERE s.name='Ene Flavia';")
cur.fetchall()

# ce vedem aici e o relatie de tip one-to-many, avem un singur student cu mai multe note...

[(6, 'Engleza', 10.0, 3, 3, 'Ene Flavia', 'ene.flavia@myschool.com', 20),
 (8, 'Informatica', 6.0, 3, 3, 'Ene Flavia', 'ene.flavia@myschool.com', 20)]

In [36]:
# acum ne dorim sa adaugam clase (Classes), unde Classes au subject, day_of_week , timeframe 
# cu precizarea ca un student poate fi inscris la mai multe clase si o clasa poate avea mai multi studenti

# TODO: cum am structura baza de date in cazul acesta??


cur.executescript("""
CREATE TABLE Classes (
class_id INTEGER PRIMARY KEY AUTOINCREMENT,
subject TEXT NOT NULL,
day_of_week TEXT NOT NULL,
timeframe TEXT NOT NULL,
student_id INTEGER NOT NULL,
FOREIGN KEY(student_id) REFERENCES Students(id)
);
""")

In [46]:
classes_values = [
    ("Informatica", 'Monday', '09-10', 1),
    ("Informatica", 'Monday', '09-10', 2),
    ("Informatica", 'Monday', '09-10', 3),
    ("Matematica", "Tuesday", '10-11',1),
    ("Matematica", "Tuesday", '10-11',2),
    ("Matematica", "Tuesday", '10-11',3),
    ("Chimie", 'Wednesday', '09-10', 1),
    ("Chimie", 'Wednesday', '09-10', 2),
    ("Chimie", 'Wednesday', '09-10', 3),
    ("Engleza", 'Friday', '11-12', 1),
    ("Engleza", 'Friday', '11-12', 2),
    ("Engleza", 'Friday', '11-12', 3)     
]

sql_query = "INSERT INTO Classes (subject, day_of_week, timeframe, student_id) VALUES (?, ?, ?, ?)"
cur.executemany(sql_query, classes_values)

In [40]:
conn.commit()

In [42]:
cur.execute("SELECT * FROM Classes;")

In [43]:
cur.fetchall()

[(1, 'Informatica', 'Monday', '09-10', 1),
 (2, 'Informatica', 'Monday', '09-10', 2),
 (3, 'Informatica', 'Monday', '09-10', 3),
 (4, 'Matematica', 'Tuesday', '10-11', 1),
 (5, 'Matematica', 'Tuesday', '10-11', 2),
 (6, 'Matematica', 'Tuesday', '10-11', 3),
 (7, 'Chimie', 'Wednesday', '09-10', 1),
 (8, 'Chimie', 'Wednesday', '09-10', 2),
 (9, 'Chimie', 'Wednesday', '09-10', 3),
 (10, 'Engleza', 'Friday', '11-12', 1),
 (11, 'Engleza', 'Friday', '11-12', 2),
 (12, 'Engleza', 'Friday', '11-12', 3)]

In [44]:
# TODO: testati niste SQL queries de UPDATE, DELETE in functie de o variabila nu de o valoare hardcodata
#   si mai incercati sa selectati din baza de date toate notele studentului cu id=1 la topic informatica folosindu`va de 
# urmatorul dictionar
# values_dict = {'id': 1, 'topic': 'Informatica'}

# Bonus: Incercati sa structurati query`urile in functii

In [ ]:
UPDATE